{
  "volume": "21",
  "edition": "3",
  "title": "DEI Initiatives and Special Purpose Districts Malfeasance Issues",
  "date": "2023-03-01",
  "summary": "March 2023 newsletter announces DEI Presentation scheduled for April 28, examines malfeasance in special purpose districts and CPA-related legal issues, establishes that municipal corporations are not subject to CPA under current law, reviews Silence No More Act prohibiting nondisclosure clauses post-2022 under RCW 49.44.211, analyzes NLRB decision overruling severance agreement cases, provides bid law compliance guidance under RCW 36.96 and RCW 36.27, and discusses Pierce County Fire Commissioners Association DEI initiatives.",
  "description": "The newsletter covers key legal updates including a scheduled DEI Presentation on April 28, discussions on malfeasance in special purpose districts and CPA-related issues, the determination that municipal corporations are not subject to CPA, the prohibition of nondisclosure clauses post-2022, an NLRB decision overruling cases on severance agreements, advice on project divisions for bid law compliance, the definition of public work under RCW 39.04.010(4), and information on DEI initiatives from the Pierce County Fire Commissioners Association.",
  "keywords": [
    "DEI Presentation",
    "Bill of Interest",
    "CPA",
    "Silence No More Act",
    "NLRB",
    "public works project",
    "RCW 36.96",
    "RCW 36.27"
  ],
  "topics": [
    "Training & Compliance",
    "Emergency Services",
    "Public Records",
    "Contract Law"
  ],
  "legal_cases": [],
  "legal_statutes": [
    "RCW 49.44.211",
    "RCW 36.96",
    "RCW 36.27"
  ],
  "categories": [
    "Training & Compliance",
    "Emergency Services",
    "Public Records",
    "Contract Law"
  ],
  "tags": [
    "DEI Presentation",
    "Bill of Interest",
    "CPA",
    "Silence No More Act",
    "NLRB",
    "public works project",
    "RCW 36.96",
    "RCW 36.27"
  ],
  "compressed_content": "",
  "search_text": "dei initiatives and special purpose districts malfeasance issues",
  "search_keywords": "Volume 21 Number 3, March 2023, Eric T. Quinn Editor, Firehouse Lawyer, DEI Presentation, malfeasance special purpose districts, CPA issues, Silence No More Act, NLRB decision, state auditor attorney general",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "March2023FINALwDEI",
  "file_size_kb": 0,
  "metadata_quality": "high",
  "processed_date": "2025-08-22",
  "source_pdf": "March2023FINALwDEI.pdf",
  "pdf_url": "/Newsletters/March2023FINALwDEI.pdf"
}