{
  "volume": 23,
  "edition": 4,
  "title": "Inside This Issue",
  "date": "2025-04-xx",
  "summary": "The newsletter discusses updates to the Public Records Act (PRA) in Washington state, highlighting its interpretation on search fees and labor expended in fulfilling public records requests. It also explores penalties for PRA violations, citing a case involving Pilloud v. Employment Security Department where the court affirmed a $250 fine despite delays. The newsletter further examines how other states handle PRA-related penalties.",
  "keywords": [
    "Public Records Act",
    "search fees",
    "Pilloud v. Employment Security Department",
    "rcw 42.56.120",
    "wa supreme court"
  ],
  "topics": [
    "Open Government Law",
    "Public Discretion Law",
    "Employment Law"
  ],
  "compressed_content": "PRA Reform Discussed: Public Records Act in Washington allows search fees or labor expended for public records requests, unlike many other states. Penalties for PRA Violations: Cases show varied penalties, with some states allowing court discretion while others set fixed amounts. Case Study: Pilloud v. Employment Security Department highlights procedural delays and their implications under the PRA. Public Records Requests: Emphasis on acknowledgment times and penalties for delayed responses. Legal Updates: The newsletter covers changes in PRA interpretation, penalties, and case law impacts.",
  "search_text": "The Firehouselawyer Newsletter Volume 23 Number 4 discusses updates to the Public Records Act (PRA) in Washington state. It highlights its interpretation on search fees and labor expended in fulfilling public records requests. The newsletter also explores penalties for PRA violations, citing a case involving Pilloud v. Employment Security Department where the court affirmed a $250 fine despite delays.",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "April2025FINAL-extracted",
  "file_size_kb": 0,
  "pdf_url": "/Newsletters/April2025FINAL.pdf"
}