{
  "volume": 15,
  "edition": 12,
  "title": "Volume 15, Number Twelve",
  "date": null,
  "summary": "The newsletter covers various legal topics including updates on sick leave laws, upcoming municipal roundtables, legislative changes to LEOFF II, and safety guidelines following an Amtrak incident. Key legal findings include discussions on accrued paid sick leave requirements, the application of RCW 49.46.210(1)(j), and updated safety protocols for emergency services.",
  "keywords": [
    "sick leave",
    "accrued paid sick leave",
    "RCW 49.46.210(1)(j)",
    "LEOFF II",
    "public records"
  ],
  "topics": [
    "Employment Law",
    "Public Records",
    "Emergency Services",
    "Contract Law",
    "Budget & Finance",
    "Training & Compliance",
    "Litigation"
  ],
  "compressed_content": "The newsletter covers various legal topics including updates on sick leave laws, upcoming municipal roundtables, legislative changes to LEOFF II, and safety guidelines following an Amtrak incident. Key legal findings include discussions on accrued paid sick leave requirements, the application of RCW 49.46.210(1)(j), and updated safety protocols for emergency services. The newsletter provides actionable recommendations for fire departments regarding sick leave caps and contributions to LEOFF II. Important legislative references include RCW 49.46.210(1)(j) and updates to LEOFF II effective for fiscal years 2018 and 2019. The newsletter emphasizes the importance of public trust in emergency services and provides guidance on maintaining accountability. Additional resources are available for those requiring legal advice.",
  "search_text": "Volume 15, Number Twelve. Firehouse Lawyer. December 2017. Contact information. Questions regarding the new sick leave law. We were recently asked whether the new sick leave law requires that 40 hours of accrued paid sick leave be carried over even if a portion of that 40 hours is used. The answer to this question would be no.",
  "corruption_detected": true,
  "corruption_notes": "Missing essential fields: date. This newsletter may have incomplete data extraction.",
  "original_filename": null,
  "slug": "December2017FINAL-extracted",
  "file_size_kb": 0,
  "pdf_url": "/Newsletters/December2017FINAL.pdf"
}