{
  "volume": 21,
  "edition": 6,
  "title": "Inside This Issue",
  "date": "2023-06-01",
  "summary": "The newsletter covers several key legal updates, including the application of Fourth Amendment exceptions to community caretaking, tax increment financing law implications for local jurisdictions, changes in cannabis testing laws affecting employment practices, considerations for used equipment purchases under bid laws, and guidance on awarding contracts under the small works roster process.",
  "keywords": [
    "Fourth Amendment",
    "Community Caretaking",
    "Tax Increment Financing Law",
    "Cannabis Testing",
    "Bid Laws",
    "Market Conditions",
    "RCW 39.114.020(5)",
    "52.14.110"
  ],
  "topics": [
    "Emergency Services",
    "Contract Law",
    "Public Policy",
    "Public Records",
    "Employment Law",
    "Budget & Finance",
    "Training & Compliance",
    "Litigation"
  ],
  "compressed_content": "The newsletter explores the application of Fourth Amendment exceptions to community caretaking. It discusses tax increment financing law and its implications for local jurisdictions. Changes in cannabis testing laws are highlighted, affecting employment practices. Considerations for used equipment purchases under bid laws are provided. Guidance on awarding contracts under the small works roster process is included.",
  "search_text": "Volume 21, Number 6\nBe sure to visit firehouselawyer.com to get a glimpse of our various practice areas pertaining to public agencies...\n\nCommunity Caretaking\nIt is not very often that the Firehouse Lawyer newsletter features a criminal case. But this is one of those rare occasions. Since 1973, the Supreme Court of the United States has held that there is an exception to the requirement for a warrant arising from the Fourth Amendment’s protection against unreasonable searches. In Cady v. Dombrowski, 413 U.S. 433 (1973) the Court upheld a warrantless search for an o\n\nTeulilo was faced with an argument that Caniglia means that Washington cases applying the “community caretaker exception” are no longer valid precedents...",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "June2023FINAL-extracted",
  "file_size_kb": 0,
  "pdf_url": "/Newsletters/June2023FINAL.pdf"
}