{
  "volume": 20,
  "edition": 6,
  "title": "Censure of Elected Official and related legal updates",
  "date": null,
  "summary": "The document discusses a Supreme Court decision affirming the authority of elected officials to censure each other for misconduct, focusing on a case involving an elected official who was censured by his peers. The newsletter also covers internal disciplinary actions taken by a fire department following a dissident commissioner's opposition to board decisions.",
  "keywords": [
    "Censure",
    "Supreme Court",
    "Elected Official",
    "Wilson v. Board of Commissioners",
    "Case 20-804-j426"
  ],
  "topics": [
    "Employment Law",
    "Public Dis closure Law",
    "Emergency Services",
    "Contract Law",
    "Budget & Finance",
    "Training & Compliance",
    "Litigation"
  ],
  "compressed_content": "The U.S. Supreme Court affirmed the authority of elected officials to censure each other for misconduct. A case involving an elected official who was censured by his peers was discussed in detail. Internal disciplinary actions taken by a fire department following opposition from a dissident commissioner were highlighted.",
  "search_text": "Volume 20, Number 6\nBe sure to visit firehouselawyer.com\\n Eric T. Quinn, Editor\nJoseph F. Quinn, Staff Writer\nThe law firm of Quinn and Quinn, P.S. is legal counsel to more than 40 Fire Departments in the State of Washington.\nOffice located at: 7403 Lakewood Drive West, Suite #11\nLakewood, WA 98499-7951\nMailing Address:\n20 Forest Glen Lane SW\nLakewood, WA 98498\nOffice Telephone: 253-590-6628\nEmails available at firehouselawyer.com\nAccess and Subscribe to this Newsletter at: firehouselawyer.com\\nInside this Issue:\nCensure of Elected Official\nMunicipal Roundtable on Diversity, Equity and Inclusion Programs\nAn Overview of a Supreme Court Decision on Censure,\nCase Wilson v. Board of Commissioners (No. 20-804-j426)\nDisciplinary Actions in Fire Departments\n",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "June2022FINAL-extracted",
  "file_size_kb": 0,
  "pdf_url": "/Newsletters/June2022FINAL.pdf"
}