{
  "volume": "20",
  "edition": "3",
  "title": "Changes in Police Use-of-Force Laws and Their Impact on Fire Departments",
  "date": "2022-03-01",
  "summary": "March 2022 newsletter discusses Washington state police use-of-force law updates through HB 1310 and SHB 1735, analyzes expanded authority for peace officers to use physical force under certain conditions while maintaining restrictions on mental health disorder intervention and involuntary transport, examines RCW 71.05.153 implications, provides guidance on fire department compliance with updated laws, and emphasizes continued coordination between emergency services and law enforcement agencies.",
  "description": "The newsletter discusses updates to Washington state's police use-of-force laws, specifically HB 1310 and SHB 1735. These changes expand the authority of peace officers to use physical force under certain conditions but do not grant them broad discretion over mental health disorders or transport individuals against their will.",
  "keywords": [
    "Open Government Act",
    "Police Use of Force",
    "Mental Health Disorders",
    "Fire Departments",
    "Law Enforcement"
  ],
  "topics": [
    "Public Law",
    "Emergency Services",
    "Legal Compliance",
    "Mental Health Rights"
  ],
  "legal_cases": [],
  "legal_statutes": [
    "HB 1310",
    "SHB 1735",
    "RCW 71.05.153"
  ],
  "categories": [
    "Public Law",
    "Emergency Services",
    "Legal Compliance",
    "Mental Health Rights"
  ],
  "tags": [
    "Open Government Act",
    "Police Use of Force",
    "Mental Health Disorders",
    "Fire Departments",
    "Law Enforcement"
  ],
  "compressed_content": "",
  "search_text": "changes in police use-of-force laws and their impact on fire departments",
  "search_keywords": "Volume 20, Number 3 Fireho March 2022 Upcoming Training on OGTA etc. Police Use of Force Changes in Washington State. HB 1310 SHB 1735 RCW 71.05.153...",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "March2022FINAL",
  "file_size_kb": 0,
  "metadata_quality": "high",
  "processed_date": "2025-08-22",
  "source_pdf": "March2022FINAL.pdf",
  "pdf_url": "/Newsletters/March2022FINAL.pdf"
}