{
  "volume": "21",
  "edition": "5",
  "title": "Paid Family Medical Leave Premium Sharing and PERC Collective Bargaining Rights",
  "date": "2023-05-01",
  "summary": "May 2023 newsletter covers Paid Family and Medical Leave (PFMLA) benefits updates including premium sharing agreement changes under RCW 50A.10.030(1)(b), analyzes collective bargaining rights under PERC cases including City of Yakima v. International Association of Fire Fighters and Whatcom County decisions, discusses Public Records Act statute of limitations applications after final agency response, and provides organizational contact information and record-keeping compliance guidance for fire departments.",
  "description": "The document covers updates on Paid Family and Medical Leave (PFMLA) benefits, including changes to premium sharing agreements under the Washington State Law (RCW 50A.10.030(1)(d)). It also discusses collective bargaining rights under labor laws (PERC cases), organizational contact information, and record-keeping requirements under the Public Records Act.",
  "keywords": [
    "PFMLA",
    "PERC",
    "PRA",
    "RCW 50A.10.030(1)(b)",
    "City of Yakima",
    "Whatcom County"
  ],
  "topics": [
    "Employment Law",
    "Public Records Act",
    "Contract Law",
    "Budget & Finance",
    "Training & Compliance",
    "Litigation"
  ],
  "legal_cases": [
    "City of Yakima v. International Association of Fire Fighters, Local 469, 117 Wn.2d 655 (1990)",
    "Whatcom County, Decision 13082-A (PECB, 2020)"
  ],
  "legal_statutes": [
    "RCW 50A.10.030(1)(b)",
    "RCW 29A.32.280"
  ],
  "categories": [
    "Employment Law",
    "Public Records Act",
    "Contract Law",
    "Budget & Finance",
    "Training & Compliance",
    "Litigation"
  ],
  "tags": [
    "PFMLA",
    "PERC",
    "PRA",
    "RCW 50A.10.030(1)(b)",
    "City of Yakima",
    "Whatcom County"
  ],
  "compressed_content": "",
  "search_text": "paid family medical leave premium sharing and perc collective bargaining rights",
  "search_keywords": "Fireho Volume 21, Number 5 Be sure to visit the library to get a glimpse at our various practice areas concerning public agencies' employment relations and collective bargaining. This article discusse...",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "May2023",
  "file_size_kb": 0,
  "metadata_quality": "high",
  "processed_date": "2025-08-22",
  "source_pdf": "May2023.pdf",
  "pdf_url": "/Newsletters/May2023.pdf"
}