{
  "volume": "20",
  "edition": "9",
  "title": "Growth Management Act Updates for Rural Fire Departments and Contract Bid Protest Procedures",
  "date": "2022-09-01",
  "summary": "September 2022 newsletter examines Growth Management Act (GMA) updates under RCW 36.70A.070 affecting rural fire departments and capacity requirements, analyzes contract law changes under RCW 52.14.130 and RCW 39.04.105 regarding bid protest procedures, discusses Dick Enterprises v. King County precedent for contract award challenges, provides guidance on sufficient capacity assessments for fire department compliance, and offers recommendations for proper bid protest documentation and injunction procedures.",
  "description": "The newsletter discusses updates to the Growth Management Act affecting rural fire departments and provides guidance on contract protests, emphasizing the importance of sufficient capacity and fair bid processes.",
  "keywords": [
    "GMA",
    "Sufficient Capacity",
    "fire departments",
    "bid protests"
  ],
  "topics": [
    "Contract Law"
  ],
  "legal_cases": [
    "Dick Enterprises v. King County, 83 Wn.App. 566 (1996)"
  ],
  "legal_statutes": [
    "RCW 36.70A.070",
    "RCW 52.14.130",
    "RCW 39.04.105"
  ],
  "categories": [
    "Contract Law"
  ],
  "tags": [
    "GMA",
    "Sufficient Capacity",
    "fire departments",
    "bid protests"
  ],
  "compressed_content": "",
  "search_text": "growth management act updates for rural fire departments and contract bid protest procedures",
  "search_keywords": "Firehousela wyer & Public Agreements, MR. Quin and Mr. Quinn, P.S., is legal counsel to more than 40 Fire Departments in the State of Washington. Our office is legal counsel to more than 40 Fire Depar...",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "September2022",
  "file_size_kb": 0,
  "metadata_quality": "medium",
  "processed_date": "2025-08-22",
  "source_pdf": "September2022.pdf",
  "pdf_url": "/Newsletters/September2022.pdf"
}