{
  "volume": "2",
  "edition": "9",
  "title": "Surplus Property Disposal Procedures and Legal Guidelines for Fire Departments",
  "date": "1998-09-30",
  "summary": "September 1998 newsletter addresses legal procedures for surplus property disposal in fire departments, emphasizes absence of applicable Washington state statutes and provides guidelines based on analogous laws under RCW 39.33.020, discusses potential liability issues arising from surplus property sales and dispositions, recommends proper documentation and legal counsel consultation, and offers framework for fire departments to safely dispose of surplus property while avoiding legal complications.",
  "description": "The newsletter discusses legal procedures for surplus property disposal in fire departments, emphasizing the absence of applicable statutes and providing guidelines based on analogous laws. It also addresses potential liability issues and recommendations for fire departments to properly dispose of surplus property.",
  "keywords": [
    "Surplus Property Disposal",
    "Fire Department Surplus Property",
    "RCW 39.33.020"
  ],
  "topics": [
    "Legal Procedures",
    "Surplus Property Law",
    "Fire Department Regulations",
    "Public Records"
  ],
  "legal_cases": [],
  "legal_statutes": [
    "RCW 39.33.020"
  ],
  "categories": [
    "Legal Procedures",
    "Surplus Property Law",
    "Fire Department Regulations",
    "Public Records"
  ],
  "tags": [
    "Surplus Property Disposal",
    "Fire Department Surplus Property",
    "RCW 39.33.020"
  ],
  "compressed_content": "",
  "search_text": "surplus property disposal procedures and legal guidelines for fire departments",
  "search_keywords": "Vol. 2, No. 9, Joseph F. Quinn, 1998, Surplus Property disposal, Firehouse Lawyer, RCW 39.33.020, fire department legal guidelines",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "v02n09sep1998",
  "file_size_kb": 0,
  "metadata_quality": "medium",
  "processed_date": "2025-08-22",
  "source_pdf": "v02n09sep1998.pdf",
  "pdf_url": "/Newsletters/v02n09sep1998.pdf"
}