{
  "volume": "13",
  "edition": "Number Eight",
  "title": "The Firehouse Lawyer | Volume 13, Number Eight",
  "date": "2015-07-01",
  "summary": "The newsletter discusses the Public Bid Law and its application to fire departments. It highlights the lack of legal requirement for fire districts to award Lowest Responsible Bidding contracts unless specified by statute. The analysis concludes that fire districts may exercise their broad powers to enter into and perform any necessary contracts, even if they are not required to award the LRB. Additional topics include business functions, employment law considerations, public records access, emergency services regulations, contract awards, budget practices, training compliance, and litigation strategies.",
  "keywords": [
    "Public Bid Law",
    "Lowest Responsible Bidder",
    "Business Function",
    "Employment Law",
    "Public Records",
    "Emergency Services",
    "Contract Law",
    "Budget & Finance",
    "Training & Compliance",
    "Litigation"
  ],
  "topics": [
    "Open Government",
    "Employment Law",
    "Public Records",
    "Emergency Services",
    "Contract Law",
    "Budget & Finance",
    "Training & Compliance",
    "Litigation"
  ],
  "compressed_content": "The newsletter explores Public Bid Law and its application to fire departments. It highlights the lack of legal requirement for fire districts to award Lowest Responsible Bidding contracts unless specified by statute. Analysis concludes that fire districts may exercise their broad powers to enter into and perform necessary contracts. Additional topics include business functions, employment law considerations, public records access, emergency services regulations, contract awards, budget practices, training compliance, and litigation strategies.",
  "search_text": "The Firehouse Lawyer | Volume 13, Number Eight\nJuly 2015\n\n[Section 1 of 1]\n\nThe Firehouse Lawyer\nVolume 13, Number Eight\nBe sure to visit this Newsletter and its contents.\n\nJoseph F. Quinn, Esq., Legal counsel to more than 40 Fire departments in the State of Washington.\n\nCase Note: Public Bid Law application to fire departments:\n- Analysis shows lack of legal requirement for Lowest Responsible Bidding contracts unless specified by statute.\n- Fire districts may exercise their broad powers to enter into and perform necessary contracts.",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "August_2015-extracted",
  "file_size_kb": 0,
  "pdf_url": "/Newsletters/August_2015.pdf"
}