{
  "volume": "20",
  "edition": "10",
  "title": "Post-COVID Emergency Declaration, RCW Procurement Piggybacking, and Prevailing Wage Law Delegation",
  "date": "2022-10-01",
  "summary": "October 2022 newsletter covers transition from COVID-19 emergency declaration and return to in-person meetings for public agencies, examines piggybacking procurement procedures under RCW 39.34.030(5)(b) allowing use of existing contracts without competition, analyzes Supreme Court decision in Barry & Barry v. Department of Motor Vehicles upholding state delegation authority in prevailing wage laws, and provides compliance guidance for procurement processes and wage law applications.",
  "description": "The newsletter highlights updates on public agencies' legal practices, including the end of a COVID-19 emergency declaration, considerations for piggybacking under RCW 39.34.030(5)(b), and a Supreme Court decision on delegation of prevail wage laws.",
  "keywords": [
    "public agencies",
    "COVID-19 emergency declaration",
    "piggybacking",
    "prevailing wage law",
    "RCW 39.34.030"
  ],
  "topics": [
    "Public Records",
    "Emergency Services",
    "Contract Law",
    "Public Law"
  ],
  "legal_cases": [
    "Barry & Barry v. Department of Motor Vehicles"
  ],
  "legal_statutes": [
    "RCW 39.34.030(5)(b)"
  ],
  "categories": [
    "Public Records",
    "Emergency Services",
    "Contract Law",
    "Public Law"
  ],
  "tags": [
    "public agencies",
    "COVID-19 emergency declaration",
    "piggybacking",
    "prevailing wage law",
    "RCW 39.34.030"
  ],
  "compressed_content": "",
  "search_text": "post-covid emergency declaration, rcw procurement piggybacking, and prevailing wage law delegation",
  "search_keywords": "Public agencies, COVID-19 emergency declaration, piggybacking under RCW 39.34.030(5)(b), prevailing wage law, Supreme Court decision on delegation...",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "October2022FINAL",
  "file_size_kb": 0,
  "metadata_quality": "high",
  "processed_date": "2025-08-22",
  "source_pdf": "October2022FINAL.pdf",
  "pdf_url": "/Newsletters/October2022FINAL.pdf"
}