{
  "volume": 22,
  "edition": "4E",
  "title": "Volume 22, Number 4E",
  "date": null,
  "summary": "The newsletter contains a correction notice regarding prevailing wage laws and information about upcoming training opportunities. It also provides details on how to attend a Municipal Roundtable and a seminar sponsored by the Pierce County Fire Commissioners Association.",
  "keywords": ["prevailing wages", "Municipal Roundtable", "Firehouse Lawyer"],
  "topics": ["Public Records", "Employment Law", "Training & Compliance"],
  "compressed_content": [
    "Correction Notice: Prevailing wage laws do not apply to state or local employees.",
    "Upcoming Training Opportunities: Free training sessions on Municipal Roundtables and seminars.",
    "Meeting Details: Details for the seminar are available via a provided link.",
    "Contact Information: For inquiries, contact Denise R at piercecountyfireassociation.org."
  ],
  "search_text": "Correction Notice: In our previous issue (Volume 22, Number 4), we indicated that employees of your fire departments who perform public works on your properties must be paid prevailing wages. Actually, such employees are not subject to the prevailing wage laws. WAC 296-127-026 (4) clearly states that 'The prevailin\ng wage requirements of chapter 39.12 RCW do not apply to: Workers regularly employed by the state or any county, municipality, or political subdivision created by its laws.' Free Training Opportunities: Two upcoming training opportunities should be of interest to our fire district and regional fire authority clients. First, another free Municipal Roundtable taking place on April 12 (Friday) from 9 to 11 AM! Second, a seminar sponsored by the Pierce County Fire Commissioners Association.",
  "legal_references": {
    "statutes": ["WAC 296-127-026 (4)"]
  },
  "key_findings": ["Prevailing wage laws do not apply to state or local employees as per WAC 296-127-026 (4)."],
  "recommendations": ["Attend the training sessions for updates on procurement laws and compliance requirements."],
  "metadata_quality": "high"
}