```json
{
  "volume": "19",
  "edition": null,
  "title": "Firehouse Lawyer Newsletter Volume 19, Number 7 - Power and Security",
  "date": "2021-10-12",
  "summary": "The article discusses the limitations of police power under Washington State statutory provisions such as RCW 36.28.010 and how these limitations affect EMS and fire departments. It emphasizes that while police have broad powers, fire and EMS departments are responsible for different functions based on statute. The public duty doctrine applies to police but not necessarily to EMS or firefighters.",
  "keywords": ["RCW", "Beltran-Serrano v. City of Seattle", "Mancenico v. City of Federal Way", "RCW 71.05.153", "RCW 46.61.035"],
  "topics": ["EMS/Firefighters' Policy", "Public Duty/Liability"],
  "compressed_content": [
    "Police power is limited under RCW 36.28.010.",
    "EMS and firefighters have different responsibilities than police.",
    "Public duty doctrine applies to police but not necessarily to EMS or firefighters."
  ],
  "search_text": "Firehouse Lawyer Newsletter Volume 19, Number 7 - Power and Security\n\nBeltran-Serrano v. City of Seattle, 193 S. W. C. 62 (2019)\nMancenico v. City of Federal Way, 84 W. W. C. 153-157 (2018)\nRCW 36.28.010: 'No power shall be delegated to any law enforcement agency or its subdivisions' explicitly and 'The police power does not extend beyond the authority of this statute' as it applies to state agencies.\n\nRCW 46.61.035: 'No act or thing may be performed by an officer or employee of a public service organization (including, without limitation, the fire department) other than in furtherance of their official duties unless directed otherwise by law.'\n\nThe Public Duty Doctrine - A case law doctrine that provides liability for negligence when a person is subjected to a lawfully act or situation that a reasonable person would have avoided or taken protective measures.\n\nFirefighters and police do not have the same authority to enter property under similar circumstances. Firefighters are required to exercise reasonable care in certain dangerous situations, such as active showers or medical emergencies.",
  "legal_references": {
    "cases": ["Beltran-Serrano v. City of Seattle", "Mancenico v. City of Federal Way"],
    "statutes": ["RCW 36.28.010", "RCW 46.61.035"]
  },
  "key_findings": [
    "Police power is limited under RCW 36.28.010.",
    "EMS and fire departments have distinct responsibilities based on statute.",
    "Public duty doctrine applies selectively to police."
  ],
  "recommendations": [
    "Fire departments should adapt to these statutory limitations by considering firefighter safety and policy alignment with EMS operations.",
    "Firefighters must exercise reasonable care in dangerous situations, such as active showers or medical emergencies.",
    "Departments should review their procedures for responding to non-emergency calls to ensure compliance with applicable statutes."
  ],
  "metadata_quality": "high"
}
```