{
  "volume": 18,
  "edition": null,
  "title": "Open Public Meetings Act and Emergency Management Act Updates",
  "date": "2020-05-01",
  "summary": "The newsletter discusses updates to the Open Public Meetings Act (OPMA) and Emergency Management Act (EMA), focusing on temporary restrictions on in-person meetings and public participation during the COVID-19 pandemic. It also provides guidance for fire departments on resuming operations under Phase Three of the state's re-opening plan.",
  "keywords": ["Open Public Meetings Act (OPMA)", "Emergency Management Act (EMA)", "Proclamation 20-28", "public participation", "in-person meetings"],
  "topics": ["Public Records"],
  "compressed_content": [
    "The Open Public Meetings Act (OPMA) and Emergency Management Act (EMA) have been updated due to the COVID-19 pandemic.",
    "Temporary restrictions on in-person meetings remain in effect until regular public participation is possible.",
    "Fire departments are encouraged to resume operations under Phase Three of the state's re-opening plan.",
    "Guidance includes allowing public comment via email and virtual meetings to facilitate remote participation."
  ],
  "search_text": "Volume 18, Number 5, Open Public Meetings Act Updates, Emergency Management Act guidance, Proclamation 20-28 extensions, fire department resume operations, Phase Three re-opening plan, public participation restrictions.",
  "legal_references": {
    "statutes": ["RCW 42.30", "RCW 42.30.020"]
  },
  "key_findings": [
    "Proclamation 20-28 has been extended to allow necessary and routine public participation.",
    "In-person meetings remain restricted until regular public participation is possible.",
    "Fire departments can resume operations under Phase Three of the state's re-opening plan."
  ],
  "recommendations": [
    "Fire departments should allow public comment via email or virtual meetings.",
    "Plan for resumption of in-person operations only when regular public participation is feasible.",
    "Monitor legal updates and consult with legal counsel regarding remote meeting capabilities."
  ],
  "metadata_quality": "medium"
}