```json
{
  "volume": 21,
  "edition": 5,
  "title": "Inside this Issue",
  "date": null,
  "summary": "The document covers updates on Paid Family and Medical Leave (PFMLA) benefits, including changes to premium sharing agreements under the Washington State Law (RCW 50A.10.030(1)(d)). It also discusses collective bargaining rights under labor laws (PERC cases), organizational contact information, and record-keeping requirements under the Public Records Act.",
  "keywords": ["PFMLA", "PERC", "PRA", "RCW 50A.10.030(1)(b)", "City of Yakima", "Whatcom County"],
  "topics": [
    "Employment Law",
    "Public Records Act",
    "Contract Law",
    "Budget & Finance",
    "Training & Compliance",
    "Litigation"
  ],
  "compressed_content": [
    "PFMLA benefits include changes to premium sharing agreements.",
    "PERC cases highlight collective bargaining rights and status quo rules.",
    "PRA statute of limitations applies to claims after final agency response.",
    "Organizational contact information is provided for fire departments.",
    "Legal updates on record-keeping requirements are detailed."
  ],
  "search_text": "Fireho Volume 21, Number 5 Be sure to visit the library to get a glimpse at our various practice areas concerning public agencies' employment relations and collective bargaining. This article discusses changes to the billing of the employees' share of the employee's premium under the paid family and medical leave act (PFMLA), codified at Title 50A of the Revised Code of Washington. Our office is legal counsel to more than 40 Fire Departments in the State of Washington.\n\nThe law firm of Eric T. Quinn, P.S. is legal counsel to more than 40 Fire Departments in the State of Washington. Our office is legal counsel to more than 40 Fire Departments in the State of Washington.",
  "legal_references": {
    "cases": ["City of Yakima v. International Association of Fire Fighters, Local 469, 117 Wn.2d 655 (1990)", "Whatcom County, Decision 13082-A (PECB, 2020)"],
    "statutes": ["RCW 50A.10.030(1)(b)", "RCW 29A.32.280"],
    "regulations": []
  },
  "key_findings": [
    "PFMLA benefits include changes to premium sharing agreements.",
    "PERC cases highlight collective bargaining rights and status quo rules.",
    "PRA statute of limitations applies to claims after final agency response.",
    "Organizational contact information is provided for fire departments."
  ],
  "recommendations": [
    "Fire departments should ensure compliance with PFMLA changes regarding premium sharing agreements.",
    "Engage in collective bargaining discussions to resolve PFMLA-related premium cost allocations.",
    "Maintain accurate organizational records to comply with PRA requirements and demonstrate timely record-keeping.",
    "Conduct regular training on employment law obligations to ensure staff awareness."
  ],
  "metadata_quality": "high"
}
```