```json
{
  "volume": 13,
  "edition": null,
  "title": "The Public Duty Doctrine and Marijuana",
  "date": null,
  "summary": "This issue explores the legal implications of marijuana use in fire departments under the public duty doctrine, focusing on whether individual firefighters can be held liable for impaired driving. Additionally, it discusses shift trade policies and their impact on overtime calculations under the Fair Labor Standards Act (FLSA).",
  "keywords": [
    "Public Duty Doctrine",
    "Failure to Enforce",
    "FLSA",
    "Shift Trade",
    "Senger v. City of Aberdeen, South Dakota",
    "RCW 49.17.060"
  ],
  "topics": ["Employment Law", "Litigation"],
  "compressed_content": [
    "1. Public Duty Doctrine and Marijuana Use in Fire Departments\n2. Shift Trade Policies and Overtime Calculations under FLSA",
    "Key legal findings include the application of the public duty doctrine to fire departments and the implications of shift trade arrangements on overtime.",
    "Recommendations for fire departments include implementing comprehensive drug use policies and enforcing them rigorously."
  ],
  "search_text": "The Public Duty Doctrine and Marijuana\nVolume 13, Number Eleven\nIn the context of public tort liability, the first thing the courts will consider is whether the defendant owes a duty of care to the plaintiff. The public duty doctrine may not apply in certain circumstances.",
  "legal_references": {
    "cases": ["Senger v. City of Aberdeen, South Dakota"],
    "statutes": ["RCW 49.17.060", "52.33.040"],
    "regulations": []
  },
  "key_findings": [
    "The public duty doctrine may not apply to certain scenarios involving fire departments.",
    "Shift trade arrangements are subject to specific calculations under the FLSA ยง207 (p)(3)."
  ],
  "recommendations": [
    "Fire departments should implement policies on drug use in the workplace.",
    "Aggressively enforce these policies to maintain compliance with relevant statutes."
  ],
  "metadata_quality": "high"
}
```