{
  "volume": 13,
  "edition": 10,
  "title": "The Doctrine of Wrongful Discharge",
  "date": "2015-10-01",
  "summary": "This newsletter explores key legal developments in wrongful discharge, including case analyses and updates on public records retention schedules. The documents discuss the abolition of strict adequacy requirements, significant cases like Becker v. Community Health, and employment law changes affecting light duty policies.",
  "keywords": [
    "Wrongful Discharge",
    "Public Policy",
    "Strict Adequacy",
    "Public Records",
    "WDVP",
    "Becker v. Community Health",
    "PERC decisions"
  ],
  "topics": ["Open Government", "Employment Law", "Public Records", "Emergency Services", "Contract Law", "Budget & Finance", "Training & Compliance", "Litigation"],
  "compressed_content": [
    "1. The Doctrine of Wrongful Discharge",
    "2. Case Analysis: Becker v. Community Health",
    "3. Employment Law Changes in Light Duty Policies",
    "4. Public Records Retention Schedules",
    "5. Impact on Agency Policies and Procedures"
  ],
  "search_text": "Fireho Volume 13, Number Ten\nBecker v. Anderson (WA), 10th Circuit\nIn September 2015, the Washington Supreme Court (Court) fundamentally altered the doctrine of wrongful discharge in violation of public policy.\nThree Court opinions, which we will discuss this month, have been designated as 'Major Change' to wrongful discharge claims.\nA claim for wrongful discharge in violation of public policy (WDVP), has been defined as not falling into a specific category (See geek.com, October 2015).\nWA. The doctrine of wrongful discharge in violation of public policy (WDVP) has been recognized in various cases.",
  "legal_references": {
    "cases": [
      "Rose v. Anderson",
      "Becker v. Community Health",
      "Rickman v. Premera"
    ],
    "statutes": [
      "RCW 49.17",
      "RCW 42.56.030",
      "RCW 40.14.070"
    ],
    "regulations": []
  },
  "key_findings": [
    "The strict adequacy requirement has been abandoned in Washington for wrongful discharge claims.",
    "An employee need not have a valid belief in wrongdoing to succeed in a WDVP claim.",
    "Agency policies and procedures do not preclude adequately defending claims."
  ],
  "recommendations": [
    "Fire departments should update their public records retention schedules based on current RCW provisions.",
    "Agencies must ensure compliance with strict adequacy requirements only for statutory protections.",
    "Light duty policies should follow the four-step process outlined in PERC decisions to avoid unilateral changes without bargaining."
  ],
  "metadata_quality": "high"
}