```json
{
  "volume": "1",
  "edition": "4",
  "title": "FIREHOUSE LAWYER",
  "date": "1997-07-31",
  "summary": "The document discusses the legal implications of using public facilities by fire departments, referencing state law and Public Disclosure Commission regulations. It highlights specific statutory provisions and case references, emphasizing the importance of normal and regular conduct in public facilities use.",
  "keywords": ["RCW", "Public Facilities Act", "Firehouse Lawyer", "Public Disclosure Commission"],
  "topics": ["Open Government (PDC)", "Emergency Services (fire departments)", "Contract Law (regulations)"],
  "compressed_content": [
    "The document discusses the legal implications of using public facilities by fire departments.",
    "It references state law and Public Disclosure Commission regulations.",
    "Specific statutory provisions are highlighted.",
    "Emphasis is placed on normal and regular conduct in public facilities use.",
    "Case references and RCW statutes are included."
  ],
  "search_text": "Vol. 1, No. 4 Joseph F. Quin. Extracted from a legal newsletter document titled 'FIREHOUSE LAWYER' dated July 31, 1997. Contains discussions on public facilities use under state law, including regulations and interpretations.",
  "legal_references": {
    "cases": [],
    "statutes": ["RCW 42.17.130", "RCW 42.17.131"],
    "regulations": ["PDC rules on voter pamphlets"]
  },
  "key_findings": [
    "The use of public facilities by fire departments is subject to state law.",
    "Specific statutory provisions and case references are cited.",
    "Normal and regular conduct in public facilities use must be followed.",
    "Public Disclosure Commission regulations are emphasized."
  ],
  "recommendations": [
    "Fire departments should adhere to specific regulations regarding public facility use.",
    "Following normal and regular conduct is essential for compliance with state law.",
    "Engaging the Public Disclosure Commission as needed is advisable for proper materials distribution."
  ],
  "metadata_quality": "medium"
}
```