```json
{
  "volume": "4",
  "edition": "1",
  "title": "FLSA - §207(k) Amended",
  "date": null,
  "summary": "The newsletter discusses amendments to the Fair Labor Standards Act (FLSA), specifically §207(k), which provides exemptions for fire protection work. It highlights cases involving paramedics and emergency medical technicians, emphasizing that EMTs do not qualify as fire protection workers under this amendment. The document also addresses wrongful discharge claims under public policy, citing a Supreme Court decision that extended such claims to cover terminations at will.",
  "keywords": ["FLSA", "§207(k)", "Firehouse Lawyer", "Case 1: Quin v. City of tacoma", "Case 2: West v. Quin"],
  "topics": ["Legal References & Updates"],
  "compressed_content": [
    "The FLSA §207(k) was amended to extend fire protection exemptions.",
    "Paramedics are not considered fire protection workers under the new amendment.",
    "EMTs generally do not qualify as fire protection workers unless specifically trained in fire suppression.",
    "The amendment clarifies that EMTs must meet additional criteria to be exempt.",
    "Case 1: Quin v. City of tacoma ruled that paramedics are not integral to fire suppression duties.",
    "Case 2: West v. Quin extended the wrongful discharge doctrine under public policy.",
    "The Public Policy extended wrongful discharge case applies to all terminations at will."
  ],
  "search_text": "FLSA §207(k) Amended Firehouse Lawyer Volume 4 No. 1 Joseph F. Quin January 31 2000 FLSA §207(k) Extension of fire protection exemptions paramedic emergency medical technician wrongful discharge public policy case ruled City of tacoma West v. Quin Public Policy extended wrongful discharge doctrine terminated at will",
  "legal_references": {
    "cases": ["Case 1: Quin v. City of tacoma", "Case 2: West v. Quin"],
    "statutes": ["RCW 1983"]
  },
  "key_findings": [
    "Amendment to FLSA §207(k) extends fire protection exemptions.",
    "Paramedics are not considered integral to fire suppression duties.",
    "EMTs generally do not qualify as fire protection workers unless specifically trained.",
    "Wrongful discharge claims under public policy now apply to terminations at will."
  ],
  "recommendations": [
    "Update fire departments and EMS agencies with the amended FLSA §207(k) requirements.",
    "Ensure accurate documentation of paramedic and EMT training programs to comply with legal standards.",
    "Review existing employment policies for compliance with wrongful discharge exceptions under public policy."
  ],
  "metadata_quality": "medium"
}
```