{
  "volume": "14",
  "edition": "8",
  "title": "Changes in Federal Laws Affecting Fire Departments",
  "date": "2016-08-01",
  "summary": "August 2016 newsletter examines federal law changes affecting fire departments including Fair Labor Standards Act (FLSA) updates, new electronic records regulations under Electronic Signature and E-Record Act (E-SIGN) in Washington state per RCW 42.56.540, Open Public Records Act compliance requirements under RCW 42.30.120, analyzes West v. Pierce County precedent for public records implementation, and provides comprehensive guidance on FLSA exemptions and electronic signature authentication requirements.",
  "description": "The document outlines changes to several federal laws impacting fire departments, including the update to the Fair Labor Standards Act (FLSA), new electronic records regulations under the Electronic Signature and E-Record Act (E-SIGN) in Washington state, and updates to the Open Public Records Act (OPMA). Key sections include compliance requirements for FLSA, implementation of e-records policies, potential civil penalties for non-compliance, and considerations for public notice.",
  "keywords": [
    "Fair Labor Standards Act",
    "Electronic Signatures Act",
    "Open Public Records Act"
  ],
  "topics": [
    "Emergency Services",
    "Contracts",
    "Public Records",
    "Electronic Records"
  ],
  "legal_cases": [
    "West v. Pierce Ctv., 95 Wn.2d 769 (1981)"
  ],
  "legal_statutes": [
    "42.56.540 Public Records Law",
    "42.30.120 Open Public Records Act"
  ],
  "categories": [
    "Emergency Services",
    "Contracts",
    "Public Records",
    "Electronic Records"
  ],
  "tags": [
    "Fair Labor Standards Act",
    "Electronic Signatures Act",
    "Open Public Records Act"
  ],
  "compressed_content": "",
  "search_text": "changes in federal laws affecting fire departments",
  "search_keywords": "Firehouse Lawyer Volume 14, Number Eight, October 2016, Electronic Records Law Update transition, Open Public Records Law August 2016, Changes in Federal Laws FLSA OSHA Exemptions",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "August2016",
  "file_size_kb": 0,
  "metadata_quality": "high",
  "processed_date": "2025-08-22",
  "source_pdf": "August2016.pdf",
  "pdf_url": "/Newsletters/August2016.pdf"
}