{
  "volume": "14",
  "edition": "Number Nine",
  "title": "Firehouse Newsletter",
  "date": "2016-09-01",
  "summary": "The newsletter discusses legal updates related to fire districts and regional fire authorities, including corrections on voting requirements for benefit charges, policy changes regarding public records under the Public Records Act, concerns about HIPAA social media breaches, a case decision affecting worker's compensation claims based on subjective findings, and updates on the Public Records Act's statute of limitations.",
  "keywords": [
    "fire district",
    "regional fire authority",
    "public records act",
    "HIPAA",
    "worker’s compensation",
    "statute of limitations"
  ],
  "topics": [
    "Open Government",
    "Employment Law",
    "Public Records",
    "Emergency Services",
    "Contract Law",
    "Budget & Finance",
    "Training & Compliance",
    "Litigation"
  ],
  "compressed_content": "Firehouse Lawyer Newsletter, Volume 14, Number Nine (September 2016) Legal updates on fire district and regional fire authority laws Corrections to previous voting requirements for worker benefit charges Policy changes regarding public records under the Public Records Act Concerns about HIPAA social media breaches affecting employee claims Case decision impacting worker's compensation based on subjective findings Updates on the Public Records Act's statute of limitations",
  "search_text": "Firehouse Lawyer Newsletter, Volume 14, Number Nine (September 2016). Legal updates on fire district and regional fire authority laws. Corrections to previous voting requirements for worker benefit charges by either a fire district or regional fire authority. Policy changes regarding public records under the Public Records Act. Concerns about HIPAA social media breaches affecting employee claims. Case decision impacting worker's compensation based on subjective findings. Updates on the Public Records Act's statute of limitations.",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "September2016CORRECTION-extracted",
  "file_size_kb": 0,
  "pdf_url": "/Newsletters/September2016CORRECTION.pdf"
}