{
  "volume": "18",
  "edition": "2",
  "title": "Proposed Legislation in Washington State Public Agencies and Health Care Services",
  "date": "2020-02-01",
  "summary": "The newsletter discusses proposed legislation affecting public agencies, including the potential impact on employee privacy under the Public Records Act (PRA) and the Janus v. AFSLGE case. It also covers a bill proposing health clinics for fire districts and updates on volunteer firefighter pensions.",
  "keywords": [
    "proposed legislation",
    "public agencies",
    "public records act",
    "employee privacy rights",
    "health care services",
    "fire districts",
    "volunteer firefighters"
  ],
  "topics": [
    "Employment Law",
    "Public Records",
    "Litigation",
    "Emergency Services",
    "Health Care",
    "Contract Law"
  ],
  "compressed_content": "- Public agencies may propose new rules to expand their services.\n- The law firm is monitoring proposed legislation related to employee privacy and public records.\n- A bill proposes health clinics for fire districts in remote areas. - Proposed legislation on public agencies and employee privacy rights.\n- Health care services expansion for fire districts.\n- Update on volunteer firefighter pensions. - SB 6582: Expands public record access with notice requirements.\n- SSHB 1888: Affects PRA exemptions regarding union dues and personal information.\n- SSB 5829: Increases volunteer firefighter pension from $300 to $350. - Fire districts may expand health care services beyond fire prevention and suppression.\n- Update on volunteer firefighter pensions with potential salary increases.",
  "search_text": "Volume 18, Number 2 February 2020 Proposed Legislation in Washington State Public Agencies and Health Care Services The law firm of Quinn and Quinn P.S. is legal counsel to more than 40 Fire Departments in the State of Washington Our office is located at 7403 Lakewood Drive West Suite #11 Lakewood WA 98499-7951 Mailing Address: 20 Forest Glen Lane SW Lakewood WA 98498 Office Telephone: 253-590-6628 Email Joe at firelaw@comcast.net Email Eric at ericquinn@firehouselawyer2.com Access and Subscribe to this Newsletter at firehouselawyer.com Inside this Issue 1 Proposed Legislationouse Lawyer February 2020 PROPOSED LEGISLATION Over the years the Firehouse Lawyer has been published we have often refrained from discussing proposed legislation that is pending before the State Legislature. My reasoning has always been that the proposed bills may never be adopted into law so it is better to wait until they are signed into law by the Governor At that point if they are significant statutes at all we will write about them to educate members of the fire service in Washington However more and more often my clients ask about proposed statutes and what our opinion might be about them Therefore we are re-examining that practice so that once a year we may include an article such as you are about to read 2020 Proposed Laws SB 6582 This one-section bill simply makes it clear that a board of fire commissioners may call for an election to increase to a five-member or a seven-member board thus making it easier for a district to enlarge its board The additional members assuming voter approval are added to the board using the existing process for filling vacancies See RCW 52 14 020 and RCW 42 12 070.",
  "corruption_detected": false,
  "corruption_notes": "",
  "original_filename": null,
  "slug": "February2020-extracted",
  "file_size_kb": 0,
  "pdf_url": "/Newsletters/February2020.pdf"
}